emacs.org
* Early Init

** [[https://github.com/jamescherti/minimal-emacs.d/blob/9fdfca3265246341ab63fe790b99bd4a2f3cca6d/early-init.el#L217][Native and byte compilation]]

If Emacs is built with native compilation support, activate it¹, if not, disable it².

#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes

  ;; 1
  (if (and (featurep 'native-compile)
           (fboundp 'native-comp-available-p)
           (native-comp-available-p))
      (setq native-comp-jit-compilation t
            package-native-compile t)
    ;; 2
    (setq features (delq 'native-compile features)))

#+end_src

** [[https://github.com/emacscollective/no-littering?tab=readme-ov-file#native-compilation-cache][Native Compilation Cache]]

Moves the Native Compilation Cache folder out of the Emacs base folder.

#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes

  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory))))

#+end_src

** Directory Variables

Variables used to reference to specific directories, using ~convert-standard-filename~ for multiple OS support.

#+begin_src emacs-lisp :tangle ./early-init.el :mkdirp yes

  (defcustom projects-code-directory (convert-standard-filename (expand-file-name "~/Projects/Code/"))
    "Path for project related to code, like applications."
    :type 'directory
    )
  (defcustom modules-directory (convert-standard-filename (expand-file-name "modules" user-emacs-directory))
    "Path for this configuration's modules."
    :type 'directory
    )

#+end_src

* Load Modules

#+begin_src emacs-lisp :tangle ./init.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src
  
#+begin_src emacs-lisp :tangle ./init.el :mkdirp yes

  (add-to-list 'load-path (expand-file-name modules-directory))

  (require 'gs-package)
  (require 'gs-settings)
  (require 'gs-fm)
  (require 'gs-keys)
  (require 'gs-org)
  (require 'gs-org-roam)
  (require 'gs-cmd)
  (require 'gs-dev)
  (require 'gs-completion)
  (require 'gs-utils)
  (require 'gs-keys-evil)
  (require 'gs-ui)

#+end_src

* [[https://github.com/jamescherti/minimal-emacs.d/blob/9fdfca3265246341ab63fe790b99bd4a2f3cca6d/early-init.el#L217][Package System Set-up]]

** Package

#+begin_quote

Simple package system [...].

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-package.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :tangle ./modules/gs-package.el :mkdirp yes

  (require 'package)
  (add-to-list 'package-archives '(
                                   "melpa" . "https://melpa.org/packages/"
                                   ))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

#+end_src

** use-package

#+begin_quote

A configuration macro for simplifying your .emacs.

#+end_quote

If ~use-package~ is not installed, refresh the package list and install it¹.

#+begin_src emacs-lisp :tangle ./modules/gs-package.el :mkdirp yes

  ;; 1
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile (require 'use-package))

  (use-package package
    :custom
    (package-install-upgrade-built-in t)
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-package.el :mkdirp yes

  (provide 'gs-package)
#+end_src

* Settings 

Configuration of default Emacs packages.

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

** Default packages

*** Advice

#+begin_quote

An overloading mechanism for Emacs Lisp functions.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package advice
    :custom
    (ad-redefinition-action 'accept)
    )

#+end_src

*** [[https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/early-init.el#L20][Byte Compilation]]

#+begin_quote

The Emacs Lisp byte compiler. This crunches Lisp source into a sort of p-code (~lapcode~) which takes up less space and can be interpreted faster.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package bytecomp
    :custom
    (byte-compile-warnings '(not obsolete))
    )

#+end_src

*** [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L104][Compilation Runtime]]

#+begin_quote

This file contains all the code needed to drive async compilations and any Lisp code needed at runtime to run native code.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package comp-run
    :custom
    (native-comp-async-report-warnings-errors 'silent)
    )

#+end_src

*** Emacs

Generic package used to configure functions and variables not included in any files.

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package emacs
    :config
    (setq define-coding-system-alias '(UTF-8 'utf-8))
    :custom
    (completion-ignore-case t) ;; 3
    (cursor-in-non-selected-windows nil)
    (debugger-stack-frame-as-list t) ;; 4
    (enable-recursive-minibuffers t)
    (frame-resize-pixelwise t) ;; 1
    (history-delete-duplicates t) ;; 4
    (load-prefer-newer t) ;; 2
    ;; Disable the cursor in the minibuffer prompt
    (minibuffer-prompt-properties '(
                                    cursor-intangible t
                                    read-only t
                                    face minibuffer-prompt
                                    )) ;; 3
    (read-buffer-completion-ignore-case t) ;; 3
    (resize-mini-windows 'grow-only)
    (text-mode-ispell-word-completion nil)
    (window-resize-pixelwise nil) ;; 1
    (words-include-escapes t)
    :hook
    (minibuffer-setup . cursor-intangible-mode) ;; 3
    )

#+end_src

**** Credits

1. [[https://codeberg.org/ashton314/emacs-bedrock/src/branch/main/early-init.el][ashton]];
2. [[https://github.com/gopar/.emacs.d/blob/main/README.org#recommended-packagessnippets-to-have-as-early-as-possible][gopar]];
3. [[https://github.com/minad/vertico?tab=readme-ov-file#configuration][minad]];
4. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]].

*** Files

#+begin_quote

Defines most of Emacs's file- and directory-handling functions, including basic file visiting, backup generation, link handling, ITS-id version control, load- and write-hook handling, and the like.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package files
    :config
    (add-hook 'after-save-hook #'executable-make-buffer-file-executable-if-script-p) ;; 1
    :custom
    (find-file-suppress-same-file-warnings t)
    (find-file-visit-truename t)
    (revert-without-query '("")) ;; 1
    (view-read-only t) ;; 1
    )

#+end_src

**** Credits

1. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]].

*** Help

#+begin_quote

Help commands for Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package help
    :custom
    (help-window-select t)
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-ibuffer?tab=readme-ov-file#configuration][iBuffer]]

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package ibuffer
    :defer t
    :hook
    (ibuffer-mode . ibuffer-auto-mode)
    )

#+end_src

*** [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L232][iMenu]]

#+begin_quote

Purpose of this package:

- To present a framework for mode-specific buffer indexes;
- A buffer index is an alist of names and buffer positions.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package imenu
    :custom
    (imenu-space-replacement nil)
    :defer t
    )

#+end_src

*** Indent

#+begin_quote

Commands for making and changing indentation in text. These are described in the Emacs manual.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package indent
    :custom
    (tab-always-indent 'complete)
    :defer t
    )

#+end_src

*** Lisp

#+begin_quote

Lisp editing for Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package lisp
    :custom
    (narrow-to-defun-include-comments t)
    :defer t
    :ensure nil
    )

#+end_src

*** Minibuffer

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package minibuffer
    :custom
    (completions-detailed t) ;; 1
    (completions-format 'one-column) ;; 1
    (completions-group t) ;; 1
    (read-file-name-completion-ignore-case t) ;; 2
    (resize-mini-windows t)
    :defer t
    :init
    (minibuffer-depth-indicate-mode)
    (minibuffer-electric-default-mode)
    )

#+end_src

**** Credits

1. [[https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/init.el#L107][ashton314]];
2. [[https://github.com/minad/vertico?tab=readme-ov-file#completion-styles-and-tab-completion][minad]].
 
*** Mouse

#+begin_quote

This package provides various useful commands (including help system access) through the mouse.  All this code assumes that mouse interpretation has been abstracted into Emacs input events.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package mouse
    :custom
    (mouse-yank-at-point t)
    )

#+end_src

*** Mule

Multilingual Enviroment.

**** Cmds

#+begin_quote

Commands for Multilingual Enviroment.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package mule-cmds
    :config
    (setq prefer-coding-system 'utf-8) ;; 1
    :custom
    (current-language-environment "UTF-8") ;; 2
    :defer t
    )

#+end_src

***** Credits

1. [[https://github.com/gopar/.emacs.d/blob/main/README.org#emacs-defaults][gopar]];
2. [[https://github.com/oantolin/emacs-config/blob/master/init.el][oantolin]].

**** Util

#+begin_quote

Utility functions for Multilingual Enviroment.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package mule-util
    :custom
    (truncate-string-ellipsis "…")
    )

#+end_src

*** New Comment

#+begin_quote

(un)comment regions of buffers.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package newcomment
    :custom
    (comment-empty-lines t)
    )

#+end_src

*** Paren

#+begin_quote

Highlight matching paren.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package paren
    :custom
    (show-paren-delay 0)
    :init
    (show-paren-mode)
    )

#+end_src

*** Password

**** Cache

#+begin_quote

Read passwords, possibly using a password cache.

#+end_quote


#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package password-cache
    :custom
    (password-cache-expiry 60)
    )

#+end_src

*** Pixel Scroll

#+begin_quote

Scroll a line smoothly.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package pixel-scroll
    :init
    (pixel-scroll-precision-mode)   
    )

#+end_src

*** Save History

#+begin_quote

Save minibuffer history.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package savehist
    :init
    (savehist-mode)
    )

#+end_src

*** Simple

#+begin_quote

A grab-bag of basic Emacs commands not specifically related to some major mode or to file-handling.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package simple
    :custom
    (completion-auto-select 'second-tab) ;; 1
    (indent-tabs-mode nil)
    (kill-do-not-save-duplicates t) ;; 4
    (kill-read-only-ok t) ;; 4
    (kill-whole-line t) ;; 4
    ;; Hides commands in completion that are not usable in the current mode
    (read-extended-command-predicate #'command-completion-default-include-p) ;; 3
    (save-interprogram-paste-before-kill t)
    (set-mark-command-repeat-pop t) ;; 4
    )

#+end_src

**** Credits

1. [[https://codeberg.org/ashton314/emacs-bedrock/src/branch/main/early-init.el][ashton]];
2. [[https://github.com/gopar/.emacs.d/blob/main/README.org#simple][gopar]];
3. [[https://github.com/minad/vertico?tab=readme-ov-file#configuration][minad]];
4. [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L55][oantolin]].

