emacs.org
*** Uniquify

#+begin_quote

Unique buffer names dependent on file name.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package uniquify
    :custom
    (uniquify-buffer-name-style 'forward)
    )

#+end_src

*** [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L71][use-package]]

#+begin_quote

A configuration macro for simplifying your .emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package use-package
    :custom
    (use-package-enable-imenu-support t)
    (use-package-vc-prefer-newest t)
    )

#+end_src

*** [[https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/early-init.el#L21][Warnings]]

#+begin_quote

Log and display warnings.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package warnings
    :custom
    (warning-suppress-log-types '((comp) (bytecomp)))
    )

#+end_src

*** [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L100][Window]]

#+begin_quote

Window tree functions.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package window
    :custom
    (recenter-positions '(top middle bottom))
    (switch-to-buffer-obey-display-actions t)
    )

#+end_src

** [[https://github.com/emacsmirror/gcmh][Garbage Collector Magic Hack]]

#+begin_quote

Enforce a sneaky Garbage Collection strategy to minimize GC interference with user activity.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package gcmh
    :ensure t
    :init
    (gcmh-mode)
    )

#+end_src

** [[https://github.com/emacscollective/no-littering][No Littering]]

#+begin_quote

The default paths used to store configuration files and persistent data are not consistent across Emacs packages. This isn’t just a problem with third-party packages but even with built-in packages.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package no-littering
    :ensure t
    :init
    (no-littering-theme-backups)
    )

#+end_src

*** [[https://github.com/emacscollective/no-littering#lock-files][Lock Files]]

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package no-littering
    :config
    (let ((dir (no-littering-expand-var-file-name "lock-files/")))
      (make-directory dir t)
      (setq lock-file-name-transforms `((".*" ,dir t))))
    )

#+end_src

*** [[https://github.com/emacscollective/no-littering?tab=readme-ov-file#recent-files][Recent Files]]

#+begin_quote

Keep track of recently opened files.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package recentf
    :config
    (add-to-list 'recentf-exclude
                 (recentf-expand-file-name no-littering-etc-directory)
                 (recentf-expand-file-name no-littering-var-directory))
    :init
    (recentf-mode)
    )

#+end_src

*** [[https://github.com/emacscollective/no-littering?tab=readme-ov-file#saved-customizations][Saved Customizations]]

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package no-littering
    :custom
    (custom-file (no-littering-expand-etc-file-name "custom.el"))
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (provide 'gs-settings) 
#+end_src

* File Management

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

** Autorevert

#+begin_quote

Whenever a file that Emacs is editing has been changed by another program the user normally has to execute the command ~revert-buffer~ to load the new content of the file into Emacs.
This package contains two minor modes: Global Auto-Revert Mode and Auto-Revert Mode. Both modes automatically revert buffers whenever the corresponding files have been changed on disk and the buffer contains no unsaved changes.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-settings.el :mkdirp yes

  (use-package autorevert
    :custom
    (auto-revert-stop-on-user-input nil)
    (global-auto-revert-non-file-buffers t)
    (auto-revert-verbose t)
    :init
    (global-auto-revert-mode t)
    )

#+end_src

** Dired

#+begin_quote

[...] major mode for directory browsing and editing.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package dired
    :commands
    (
     dired
     dired-jump
     )
    :custom
    (dired-auto-revert-buffer t)
    (dired-dwim-target t)
    (dired-listing-switches "-agho --group-directories-first")
    (dired-mouse-drag-files t)
    )

#+end_src

*** Auxiliary

#+begin_quote

Less commonly used parts of Dired.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package dired-aux
    :custom
    (dired-do-revert-buffer t)
    )

#+end_src

*** [[https://github.com/protesilaos/dired-preview][Dired Preview]]
 
#+begin_quote

Automatically preview file at point in Emacs Dired.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package dired-preview
    :custom
    (dired-preview-delay 0.5)
    (dired-preview-ignored-extensions-regexp (concat
                                              "\\(gs\\|"
                                              "zst\\|"
                                              "tar\\|"
                                              "xz\\|"
                                              "rar\\|"
                                              "zip\\|"
                                              "iso\\|"
                                              "epub"
                                              "\\)"
                                              ))
    :ensure t
    :init
    (dired-preview-global-mode)
    )

#+end_src

**** [[https://protesilaos.com/emacs/dired-preview#h:088fc7b3-7d7b-434b-80b1-e2ad20bdb4ea][Credits]]

** Emacs

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package dired
    :custom
    (delete-by-moving-to-trash t)
    )

#+end_src

** Mouse

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package mouse
    :custom
    (mouse-drag-and-drop-region-cross-program t)
    )

#+end_src

** [[https://github.com/vedang/pdf-tools][PDF-Tools]]

#+begin_quote

Emacs support library for PDF files.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package pdf-tools
    :bind
    (
     :map pdf-view-mode-map
     ([remap scroll-up-command] . pdf-view-scroll-up-or-next-page)
     ([remap scroll-down-command] . pdf-view-scroll-down-or-previous-page)
     )
    :defer t
    :ensure t
    :hook
    (pdf-view-mode . pdf-view-themed-minor-mode)
    )

#+end_src

**** [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L859][Credits]]

** [[https://github.com/xenodium/ready-player][Ready Player Mode]]

#+begin_quote

A lightweight major mode to open media (audio/video) files in an Emacs buffer.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package ready-player
    :custom
    (ready-player-previous-icon "󰒮")
    (ready-player-play-icon "󰐊")
    (ready-player-stop-icon "󰓛")
    (ready-player-next-icon "󰒭")
    (ready-player-shuffle-icon "󰒝")
    (ready-player-open-externally-icon "󰒖")
    (ready-player-repeat-icon "󰑖")
    (ready-player-autoplay-icon "󰼛")
    :ensure t
    :init
    (ready-player-mode)
    )

#+end_src

** [[https://github.com/protesilaos/show-font][Show Font]]

#+begin_quote

Show font features in an Emacs buffer.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (use-package show-font
    :vc (:url "https://github.com/protesilaos/show-font")
    :ensure t
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-fm.el :mkdirp yes

  (provide 'gs-fm)
#+end_src

* Key Binding

Key bindings for default packages.

** [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Key-Binding-Conventions.html][Key Binding Conventions]]

#+begin_quote

- Don't define C-c letter as a key in Lisp programs. Sequences consisting of C-c and a letter (either upper or lower case; ASCII or non-ASCII) are reserved for users [...];
- Function keys F5 through F9 without modifier keys are also reserved for users to define.
- Sequences consisting of C-c followed by a control character or a digit are reserved for major modes;
- Sequences consisting of C-c followed by {, }, <, >, : or ; are also reserved for major modes;
- Sequences consisting of C-c followed by any other ASCII punctuation or symbol character are allocated for minor modes [...];
- Don't bind C-h following any prefix character (including C-c);
- [...] don't bind a key sequence ending in C-g, since that is commonly used to cancel a key sequence.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

** Development

*** Eglot

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package eglot
    :bind
    (
     :map prog-mode-map
     ("C-c C-x e" . eglot)
     )
    )

#+end_src

*** Flymake

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package flymake
    :bind
    (
     :map prog-mode-map
     ("C-c C-x f" . flymake-start) 
     )
    )

#+end_src

** Emacs

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package emacs
    :bind
    ("C-c i c" . insert-char)
    ("C-c k e" . kill-emacs)
    )

#+end_src

** Emoji

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package emoji
    :bind
    ("C-c i e" . emoji-insert)
    )

#+end_src

** Face Remap

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package face-remap
    :bind
    ("C-=" . text-scale-increase)
    ("C--" . text-scale-decrease)
    )

#+end_src

** Files

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package files
    :bind
    ("C-c f r" . recover-this-file)
    ("C-c b r" . revert-buffer)
    )

#+end_src

** Grep

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package grep
    :bind
    ("C-c g g" . grep)
    ("C-c g r" . rgrep)
    )

#+end_src

** Help

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package help
    :bind
    ("C-h C-b" . describe-prefix-bindings)
    )

#+end_src

** iSearch

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package isearch
    :bind
    ("C-s" . isearch-forward-word)
    )

#+end_src

** Lisp

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package lisp
    :bind
    ("C-c p c" . check-parens)
    :defer t
    :demand t
    :ensure nil
    )

#+end_src

** Org Mode

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org
    :bind
    (
     :map org-mode-map
     ([remap org-narrow-to-subtree] . org-toggle-narrow-to-subtree)
     ("M-p" . org-move-subtree-up)
     ("M-n" . org-move-subtree-down)
     ("C-c o s e" . org-sort-entries)
     )
    )

#+end_src

*** [[https://github.com/daviwil/dotfiles/blob/f5e2ff06e72f2f92ab53c77a98900476274cb3ee/.emacs.d/modules/dw-workflow.el#L52][Agenda]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-agenda
    :bind
    ("C-c o a" . org-agenda)
    (
     :map org-mode-map
     ("C-c o v q" . (lambda ()
                      (interactive)
                      ;; Filter tasks by tag
                      (org-tags-view t)))
     )
    )

#+end_src

*** Capture

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-capture
    :bind
    (
     :map org-mode-map
     ("C-c o c" . org-capture)
     )
    )

#+end_src

*** Export

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package ox
    :bind
    (
     :map org-mode-map
     ("C-c o x" . org-export-dispatch)
     )
    )

#+end_src

*** Keys

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-keys
    :custom
    (org-return-follows-link t)
    (org-use-speed-commands t)
    )

#+end_src

*** Links

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package ol
    :bind
    (
     :map org-mode-map
     ("C-c o l i" . org-insert-link)
     ("C-c o l s" . org-store-link)
     )
    )

#+end_src

*** List

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-list
    :bind
    (
     :map org-mode-map
     ("C-c o s l" . org-sort-list)
     )
    )

#+end_src

