modules/gs-settings.el

(use-package uniquify
  :custom
  (uniquify-buffer-name-style 'forward)
  )

(use-package use-package
  :custom
  (use-package-enable-imenu-support t)
  (use-package-vc-prefer-newest t)
  )

(use-package warnings
  :custom
  (warning-suppress-log-types '((comp) (bytecomp)))
  )

(use-package window
  :custom
  (recenter-positions '(top middle bottom))
  (switch-to-buffer-obey-display-actions t)
  )

(use-package gcmh
  :ensure t
  :init
  (gcmh-mode)
  )

(use-package no-littering
  :ensure t
  :init
  (no-littering-theme-backups)
  )

(use-package no-littering
  :config
  (let ((dir (no-littering-expand-var-file-name "lock-files/")))
    (make-directory dir t)
    (setq lock-file-name-transforms `((".*" ,dir t))))
  )

(use-package recentf
  :config
  (add-to-list 'recentf-exclude
               (recentf-expand-file-name no-littering-etc-directory)
               (recentf-expand-file-name no-littering-var-directory))
  :init
  (recentf-mode)
  )

(use-package no-littering
  :custom
  (custom-file (no-littering-expand-etc-file-name "custom.el"))
  )

(provide 'gs-settings)

(use-package autorevert
  :custom
  (auto-revert-stop-on-user-input nil)
  (global-auto-revert-non-file-buffers t)
  (auto-revert-verbose t)
  :init
  (global-auto-revert-mode t)
  )
