emacs.org
*** Refile

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-refile
    :bind
    (
     :map org-mode-map
     ("C-c o r" . org-refile)
     )
    )

#+end_src

*** Table

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package org-table
    :bind
    (
     :map org-mode-map
     ("C-c o -" . org-table-insert-hline)
     )
    )

#+end_src

** Sort

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package sort
    :bind
    ("C-c l d" . delete-duplicate-lines)
    )

#+end_src

** [[https://github.com/kickingvegas/casual-suite][Casual Suite]]

#+begin_quote

Casual Suite - An umbrella package to support a single install point for all Casual porcelains.

#+end_quote

*** [[https://github.com/kickingvegas/casual-agenda][Agenda]]

#+begin_quote

Casual Agenda is an opinionated Transient-based user interface for Emacs Org Agenda.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-agenda
    :bind
    (
     :map org-agenda-mode-map
          ("M-o" . casual-agenda-tmenu)
          )
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-bookmarks][Bookmarks]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-bookmarks
    :bind
    (
     :map bookmark-bmenu-mode-map
     ("J" . bookmark-jump)
     ("M-o" . casual-bookmarks-tmenu)
     ("S" . casual-bookmarks-sortby-tmenu)
     )
    :config
    (easy-menu-add-item global-map '(menu-bar)
                        casual-bookmarks-main-menu
                        "Tools")
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-calc][Calc]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-calc
    :bind
    (
     :map calc-mode-map
     ("M-o" . casual-calc-tmenu)
     :map calc-alg-map
     ("M-o" . casual-calc-tmenu)
     )
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-dired][Dired]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-dired
    :bind
    (
     :map dired-mode-map
     ("M-o" . casual-dired-tmenu)
     )
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-ibuffer][iBuffer]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-ibuffer
    :bind
    (
     :map ibuffer-mode-map
     ("M-o" . casual-ibuffer-tmenu)
     ("F" . casual-ibuffer-filter-tmenu)
     ("s" . casual-ibuffer-sortby-tmenu)
     ("<double-mouse-1>" . ibuffer-visit-buffer)
     ("M-<double-mouse-1>" . ibuffer-visit-buffer-other-window)
     ("{" . ibuffer-backwards-next-marked)
     ("}" . ibuffer-forward-next-marked)
     ("[" . ibuffer-backward-filter-group)
     ("]" . ibuffer-forward-filter-group)
     ("$" . ibuffer-toggle-filter-group)
     )
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-info][Info]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-info
    :bind
    (
     :map Info-mode-map
     ("M-o" . casual-info-tmenu)
     ("M-[" . Info-history-back)
     ("M-]" . Info-history-forward)
     ("p" . casual-info-browse-backward-paragraph)
     ("n" . casual-info-browse-forward-paragraph)
     ("B" . bookmark-set)
     )
    :ensure t
    :hook
    (info-mode . scroll-lock-mode)
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-isearch][iSearch]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-isearch
    :bind
    (
     :map isearch-mode-map
     ("M-o" . casual-isearch-tmenu)
     )
    :ensure t
    )

#+end_src

*** [[https://github.com/kickingvegas/casual-re-builder][RE-Builder]]

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (use-package casual-re-builder
    :bind
    (
     :map reb-mode-map
     ("M-o" . casual-re-builder-tmenu)
     :map reb-lisp-mode-map
     ("M-o" . casual-re-builder-tmenu)
     )
    :ensure t
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-keys.el :mkdirp yes

  (provide 'gs-keys)
#+end_src

* Org Mode

#+begin_quote

Org is a mode for keeping notes, maintaining ToDo lists, and doing project planning with a fast and effective plain-text system.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org
    :config
    (add-to-list 'org-latex-packages-alist '(
                                             "" "bookmark" t
                                             "" "cancel" t
                                             ))
    :custom
    (org-adapt-indentation t)
    (org-auto-align-tags nil)
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-reverse-note-order t)
    (org-startup-indented t)
    (org-tags-column 0)
    (org-todo-repeat-to-state t)
    (org-use-sub-superscripts '{})
    :hook
    (org-mode . variable-pitch-mode)
    (org-mode . visual-line-mode)
    )

#+end_src

** Startup

This just makes the scratch buffer use Org Mode instead.

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package startup
    :custom
    (initial-major-mode 'org-mode)
    :defer t
    )

#+end_src

** Babel

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '(
       (emacs-lisp . t)
       (js . t)
       (latex . t)
       (python . t)
       (shell . t)
       ))
    
    (push '("conf-unix" . conf-unix) org-src-lang-modes)
    (add-hook 'after-save-hook 'org-babel-tangle)
    )

#+end_src

** Agenda

#+begin_quote

Dynamic task and appointment lists for Org.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-agenda
    :custom
    (org-agenda-custom-commands
     '((
        "d" "Daily Agenda"
        (
         (agenda ""
                 ((org-agenda-overriding-header "High Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#A"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))
         
         (agenda ""
                 ((org-agenda-overriding-header "Medium Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#B"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))
         
         (agenda ""
                 ((org-agenda-overriding-header "Low Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#C"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))
         )
        )))
    (org-agenda-restore-windows-after-quit t)
    (org-agenda-skip-scheduled-if-done t)
    (org-agenda-skip-timestamp-if-done t)
    (org-agenda-start-with-log-mode t)
    (org-agenda-tags-column 0)
    (org-agenda-window-setup 'only-window)
    )

#+end_src

*** Org Habit

#+begin_quote

The habit tracking code for Org.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-habit
    :custom
    (org-habit-graph-column 100)
    )

#+end_src

** Clock

#+begin_quote

The time clocking code for Org mode.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-clock
    :custom
    (org-clock-persist t)
    (org-clock-report-include-clocking-task t)
    )

#+end_src

** Compat

#+begin_quote

This file contains code needed for compatibility with older versions of GNU Emacs and integration with other packages.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-compat
    :custom
    (org-fold-catch-invisible-edits 'show-and-error)
    )

#+end_src

** Cycle

#+begin_quote

Visibility cycling of Org entries.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-cycle
    :custom
    (org-cycle-emulate-tab 'whitestart)
    )

#+end_src

** Latex

#+begin_quote

LaTeX Backend for Org Export Engine.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package ox-latex
    :custom
    (org-latex-toc-command "\\tableofcontents \\pagebreak")
    (org-startup-with-latex-preview t)
    (org-preview-latex-default-process 'dvisvgm) ;; 1
    (org-preview-latex-image-directory (expand-file-name "ltximg" temporary-file-directory))
    )

#+end_src

1. ~dvipng~ doesn't work for me for some reason.
   
*** Packages to install

**** Fedora

#+begin_src bash

sudo dnf install texlive-collection-basic texlive-bookmark texlive-cancel texlive-chemfig texlive-circuitikz texlive-dvipng texlive-dvisvgm

#+end_src bash

** List

#+begin_quote

Plain lists for Org.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-list
    :custom
    (org-list-allow-alphabetical t)
    )

#+end_src

** Modules

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org
    :config
    (add-to-list 'org-modules '(
                                org-habit
                                org-id
                                org-protocol
                                )
                 )
    )

#+end_src

** Refile

#+begin_quote

Org refile allows you to refile subtrees to various locations.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-refile
    :config
    (advice-add 'org-refile :after 'org-save-all-org-buffers)  
    :custom
    (org-outline-path-complete-in-steps nil)
    (org-refile-allow-creating-parent-nodes 'confirm)
    (org-refile-targets '(
                          (nil :maxlevel . 1)
                          (org-agenda-files :maxlevel . 1)
                          ))
    (org-refile-use-outline-path t)
    )

#+end_src

