emacs.org
** [[https://github.com/daviwil/dotfiles/blob/f5e2ff06e72f2f92ab53c77a98900476274cb3ee/.emacs.d/modules/dw-workflow.el#L442][Tags]]

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org
    :custom
    (org-tag-alist '(
                     ;; Places
                     (:startgroup)
                     ("Places")
                     (:grouptags)
                     ("@home" . ?h)
                     (:endgroup)

                     ;; Contexts
                     (:startgroup)
                     ("Contexts")
                     (:grouptags)
                     ("@computer" . ?c)
                     ("@mobile" . ?m)
                     (:endgrouptag)

                     ;; Task Types
                     (:startgroup)
                     ("Types")
                     (:grouptags)
                     ("@hacking" . ?H)
                     ("@writing" . ?w)
                     ("@creative" . ?C)
                     ("@accounting" . ?a)
                     ("@email" . ?e)
                     ("@system" . ?s)
                     (:endgrouptag)

                     ;; Workflow states
                     (:startgroup)
                     ("States")
                     (:grouptags)
                     ("@plan" . ?p)
                     ("@review" . ?r)
                     (:endgroup)
                     ))
    )  
#+end_src

** TODOs

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org
    :custom
    (org-todo-keywords '(
                         (sequence
                          "TODO(t)"
                          "WRITE(W)"
                          "WAIT(w!)"
                          "|"
                          "DONE(d!)"
                          "BACKLOG(b)"
                          "CANCELLED(c@)"
                          )
                         (sequence
                          "GOAL(g)"
                          "PROJ(p)"
                          "|"
                          "DONE(d!)"
                          )
                         (sequence
                          "FIX(f@)"
                          "FEAT(F@)"
                          "STYLE(s)"
                          "REFACTOR(r)"
                          "CHORE(C@)"
                          "|"
                          "MERGED(m)"
                          "CLOSED(x@)"
                          )
                         ))
    )

#+end_src

** [[https://github.com/io12/org-fragtog][Fragtog]]

#+begin_quote

Automatically toggle Org mode LaTeX fragment previews as the cursor enters and exits them.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-fragtog
    :ensure t
    :hook
    (org-mode . org-fragtog-mode)
    )

#+end_src

** [[https://github.com/awth13/org-appear][Appear]]

#+begin_quote

Toggle visibility of hidden Org mode element parts upon entering and leaving an element.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-appear
    :custom
    (org-appear-autoentities t)
    (org-appear-autolinks t)
    (org-appear-autosubmarkers t)
    :ensure t
    :hook
    (org-mode . org-appear-mode)
    )

#+end_src

** [[https://github.com/nobiot/org-transclusion][Transclusion]]

#+begin_quote

Org-transclusion lets you insert a copy of text content via a file link or ID link within an Org file. It lets you have the same content present in different buffers at the same time without copy-and-pasting it. Edit the source of the content, and you can refresh the transcluded copies to the up-to-date state. Org-transclusion keeps your files clear of the transcluded copies, leaving only the links to the original content.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (use-package org-transclusion
    :ensure t
    :hook
    (org-mode . org-transclusion-mode)
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes

  (provide 'gs-org) 
#+end_src

* [[https://github.com/org-roam/org-roam][Org Roam]]

#+begin_quote

Rudimentary Roam replica with Org-mode.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-org.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp :tangle ./modules/gs-org-roam.el :mkdirp yes

  (use-package org-roam
    :bind
    ("C-c r f" . org-roam-node-find)
    ("C-c r i" . org-roam-node-insert)
    :demand t
    :ensure t
    :init
    (org-roam-db-autosync-mode)
    )

#+end_src

** Capture templates

#+begin_src emacs-lisp :tangle ./modules/gs-org-roam.el :mkdirp yes

  (use-package org-roam
    :custom
    (org-roam-capture-templates '(
                                  ("b" "book notes" plain
                                   (file "~/org-roam/templates/book_note.org")
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Book-Notes\n\n")
                                   :unnarrowed t)
                                  ("d" "default" plain
                                   (file "~/org-roam/templates/default.org") 
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n\n")
                                   :unnarrowed t)
                                  ("n" "notegpt.io" plain
                                   (file "~/org-roam/templates/notegpt.io.org")
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: notegpt.io Hacker-News\n\n")
                                   :unnarrowed t)
                                  ("r" "redação" plain
                                   (file "~/org-roam/templates/redação.org")
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Redação\n\n")
                                   :unnarrowed t)
                                  ("s" "summarize.ing" plain
                                   (file "~/org-roam/templates/summarize.ing.org")
                                   :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: summarize.ing\n\n")
                                   :unnarrowed t)
                                  ))
    )

#+end_src

** Dailies

#+begin_src emacs-lisp :tangle ./modules/gs-org-roam.el :mkdirp yes

  (use-package org-roam-dailies
    :bind-keymap
    ("C-c r d" . org-roam-dailies-map)
    :bind 
    (
     :map org-roam-dailies-map
     ("Y" . org-roam-dailies-capture-yesterday)
     ("T" . org-roam-dailies-capture-tomorrow)
     )
    :custom
    (dw/daily-note-filename "%<%Y-%m-%d>.org")
    (dw/daily-note-header "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
    :demand t
    )

#+end_src

*** [[https://github.com/daviwil/dotfiles/blob/f5e2ff06e72f2f92ab53c77a98900476274cb3ee/.emacs.d/modules/dw-workflow.el#L243][Capture templates]]

#+begin_src emacs-lisp :tangle ./modules/gs-org-roam.el :mkdirp yes

  (use-package org-roam-dailies
    :custom
    (org-roam-dailies-capture-templates '(
                                          ("d" "default" entry
                                           "* %?"
                                           :if-new (file+head ,dw/daily-note-filename
                                                              ,dw/daily-note-header))
                                          ("t" "task" entry
                                           "* TODO %?\n  %U\n  %a\n  %i"
                                           :if-new (file+head+olp ,dw/daily-note-filename
                                                                  ,dw/daily-note-header
                                                                  ("Tasks"))
                                           :empty-lines 1)
                                          ("l" "log entry" entry
                                           "* %<%I:%M %p> - %?"
                                           :if-new (file+head+olp ,dw/daily-note-filename
                                                                  ,dw/daily-note-header
                                                                  ("Log")))
                                          ("j" "journal" entry
                                           "* %<%I:%M %p> - Journal  :journal:\n\n%?\n\n"
                                           :if-new (file+head+olp ,dw/daily-note-filename
                                                                  ,dw/daily-note-header
                                                                  ("Log")))
                                          ("m" "meeting" entry
                                           "* %<%I:%M %p> - %^{Meeting Title}  :meetings:\n\n%?\n\n"
                                           :if-new (file+head+olp ,dw/daily-note-filename
                                                                  ,dw/daily-note-header
                                                                  ("Log")))
                                          ))
    )

#+end_src

