modules/gs-org-roam.el
(use-package org-roam
  :bind
  ("C-c r f" . org-roam-node-find)
  ("C-c r i" . org-roam-node-insert)
  :custom
  (org-roam-completion-everywhere t)
  :demand t
  :ensure t
  :init
  (org-roam-db-autosync-mode)
  )

(use-package org-roam
  :custom
  (org-roam-capture-templates '(
                                ("b" "book notes" plain
                                 (file "~/org-roam/templates/book_note.org")
                                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :book_notes:\n\n")
                                 :unnarrowed t)
                                ("d" "default" plain
                                 (file "~/org-roam/templates/default.org") 
                                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n\n")
                                 :unnarrowed t)
                                ("n" "notegpt.io" plain
                                 (file "~/org-roam/templates/notegpt.io.org")
                                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :notegpt_io:hacker_news:\n\n")
                                 :unnarrowed t)
                                ("r" "redação" plain
                                 (file "~/org-roam/templates/redação.org")
                                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :redação:\n\n")
                                 :unnarrowed t)
                                ("s" "summarize.ing" plain
                                 (file "~/org-roam/templates/summarize.ing.org")
                                 :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :summarize_ing:\n\n")
                                 :unnarrowed t)
                                ))
  )

(use-package org-roam-dailies
  :bind-keymap
  ("C-c r d" . org-roam-dailies-map)
  :bind 
  (
   :map org-roam-dailies-map
   ("Y" . org-roam-dailies-capture-yesterday)
   ("T" . org-roam-dailies-capture-tomorrow)
   )
  :custom
  (dw/daily-note-filename "%<%Y-%m-%d>.org")
  (dw/daily-note-header "#+title: %<%Y-%m-%d %a>\n\n[[roam:%<%Y-%B>]]\n\n")
  :demand t
  )

(use-package org-roam-dailies
  :custom
  (org-roam-dailies-capture-templates '(
                                        ("d" "default" entry
                                         "* %?"
                                         :if-new (file+head ,dw/daily-note-filename
                                                            ,dw/daily-note-header))
                                        ("t" "task" entry
                                         "* TODO %?\n  %U\n  %a\n  %i"
                                         :if-new (file+head+olp ,dw/daily-note-filename
                                                                ,dw/daily-note-header
                                                                ("Tasks"))
                                         :empty-lines 1)
                                        ("l" "log entry" entry
                                         "* %<%I:%M %p> - %?"
                                         :if-new (file+head+olp ,dw/daily-note-filename
                                                                ,dw/daily-note-header
                                                                ("Log")))
                                        ("j" "journal" entry
                                         "* %<%I:%M %p> - Journal  :journal:\n\n%?\n\n"
                                         :if-new (file+head+olp ,dw/daily-note-filename
                                                                ,dw/daily-note-header
                                                                ("Log")))
                                        ("m" "meeting" entry
                                         "* %<%I:%M %p> - %^{Meeting Title}  :meetings:\n\n%?\n\n"
                                         :if-new (file+head+olp ,dw/daily-note-filename
                                                                ,dw/daily-note-header
                                                                ("Log")))
                                        ))
  )

(use-package org-agenda
  :bind
