modules/gs-org.el

                   ;; Workflow states
                   (:startgroup)
                   ("States")
                   (:grouptags)
                   ("@plan" . ?p)
                   ("@review" . ?r)
                   (:endgroup)
                   ))
  )

(use-package org
  :custom
  (org-todo-keywords '(
                       (sequence
                        "TODO(t)"
                        "WRITE(W)"
                        "WAIT(w!)"
                        "|"
                        "DONE(d!)"
                        "BACKLOG(b)"
                        "CANCELLED(c@)"
                        )
                       (sequence
                        "GOAL(g)"
                        "PROJ(p)"
                        "|"
                        "DONE(d!)"
                        )
                       (sequence
                        "FIX(f@)"
                        "FEAT(F@)"
                        "STYLE(s)"
                        "REFACTOR(r)"
                        "CHORE(C@)"
                        "|"
                        "MERGED(m)"
                        "CLOSED(x@)"
                        )
                       ))
  )

(use-package org-fragtog
  :ensure t
  :hook
  (org-mode . org-fragtog-mode)
  )

(use-package org-appear
  :custom
  (org-appear-autoentities t)
  (org-appear-autolinks t)
  (org-appear-autosubmarkers t)
  :ensure t
  :hook
  (org-mode . org-appear-mode)
  )

(use-package org-transclusion
  :ensure t
  :hook
  (org-mode . org-transclusion-mode)
  )

(provide 'gs-org)

;;; -*- lexical-binding: t -*-
