emacs.org
** [[https://github.com/oantolin/orderless][Orderless]]

#+begin_quote

Emacs completion style that matches multiple regexps in any order.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package orderless
    :config
    (orderless-define-completion-style orderless+initialism
      (orderless-matching-styles '(
                                   orderless-annotation
                                   orderless-initialism
                                   orderless-literal-prefix
                                   orderless-regexp
                                   )))
    :custom
    (completion-category-defaults nil)
    (completion-category-overrides '(
                                     (file (styles partial-completion))
                                     ))
    (completion-styles '(orderless))
    (orderless-matching-styles '(
                                 orderless-literal
                                 orderless-regexp
                                 ))
    (orderless-style-dispatchers (list
                                  #'orderless-affix-dispatch
                                  #'+orderless-consult-dispatch
                                  ))
    :ensure t
    :preface
    (defun +orderless--consult-suffix ()
      "Regexp which matches the end of string with Consult tofu support."
      (if (and (boundp 'consult--tofu-char) (boundp 'consult--tofu-range))
          (format "[%c-%c]*$"
                  consult--tofu-char
                  (+ consult--tofu-char consult--tofu-range -1))
        "$"))
    ;; Recognizes the following patterns:
    ;; * .ext (file extension)
    ;; * regexp$ (regexp matching at end)
    (defun +orderless-consult-dispatch (word _index _total)
      (cond
       ;; Ensure that $ works with Consult commands, which add disambiguation suffixes
       ((string-suffix-p "$" word)
        `(orderless-regexp . ,(concat (substring word 0 -1) (+orderless--consult-suffix))))))
    )

#+end_src

*** [[https://github.com/minad/consult/wiki#minads-orderless-configuration][Credits]]

** [[https://github.com/minad/cape][Cape]]

#+begin_quote

Completion At Point Extensions.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package cape
    :config
    (add-hook 'completion-at-point-functions #'cape-keyword)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    :ensure t
    )

#+end_src

** [[https://github.com/isamert/corg.el][Corg]]

#+begin_quote

Auto complete org-mode headers seamlessly.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package corg
    :vc (:url "https://github.com/isamert/corg.el")
    :config
    (add-hook 'org-mode-hook #'corg-setup)
    :ensure t
    )

#+end_src

** [[https://github.com/minad/tempel][Tempel]]

#+begin_quote

Simple templates for Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package tempel
    :config
    (add-hook 'completion-at-point-functions #'tempel-complete)
    :custom
    (tempel-trigger-prefix "<")
    :ensure t
    :hook
    (prog-mode . tempel-abbrev-mode)
    )

#+end_src

*** [[https://github.com/fejfighter/eglot-tempel][Eglot]]

#+begin_quote

Bridge for tempel templates with eglot.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package eglot-tempel
    :ensure t
    :hook
    (eglot . eglot-tempel-mode)
    )

#+end_src

*** [[https://github.com/Crandel/tempel-collection][Collection]]

#+begin_quote

Collection tempel templates.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package tempel-collection
    :ensure t
    )

#+end_src

** [[https://github.com/minad/corfu][Corfu]]

#+begin_quote

COmpletion in Region FUnction.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package corfu
    :bind
    (
     :map corfu-map
     ("M-SPC" . corfu-insert-separator)
     ("RET" . nil)
     )
    :config
    (global-corfu-mode)
    (corfu-history-mode)
    (corfu-popupinfo-mode)
    :custom
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 0.0)
    (corfu-cycle t)
    (corfu-preselect 'directory)
    :ensure t
    )

#+end_src

*** [[https://github.com/minad/corfu/wiki#configuring-corfu-for-eglot][Configuring Corfu for Eglot]]

**** [[https://github.com/minad/corfu/wiki#filter-list-of-all-possible-completions-with-completion-style-like-orderless][Orderless]]

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package orderless
    :custom
    (completion-category-overrides '((eglot (styles orderless))
                                     (eglot-capf (styles orderless))))
    )

#+end_src

**** [[https://github.com/minad/corfu/wiki#continuously-update-the-candidates][Cape]]

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package cape
    :config
    (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
    )

#+end_src

**** [[https://github.com/minad/corfu/wiki#making-a-cape-super-capf-for-eglot][Emacs]]

With the combined features of cape and tempel, create a super capf for eglot completion.

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package corfu
    :if (package-installed-p '(cape tempel))
    :after (cape tempel)
    :preface
    (defun minad/eglot-capf ()
      "eglot capf with tempel and cape features."
      (setq-local completion-at-point-functions
                  (list (cape-capf-super
                         #'cape-file
                         #'eglot-completion-at-point
                         #'tempel-expand
                         ))))
    (add-hook 'eglot-managed-mode-hook #'minad/eglot-capf)
    )

#+end_src

** [[https://github.com/minad/vertico][Vertico]]

#+begin_quote

VERTical Interactive COmpletion.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package vertico
    :custom
    (vertico-cycle t)
    :ensure t
    :init
    (vertico-mode)
    :preface
    (defun crm-indicator (args)
      "Add a prompt indicator to `completing-read-multiple'."
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (aref args))
            (aref args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)
    )

#+end_src

*** [[https://github.com/minad/vertico?tab=readme-ov-file#extensions][Vertico Directory]]

#+begin_quote

Commands for Ido-like directory navigation.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package vertico-directory
    :after vertico
    :bind
    (
     :map vertico-map
     ("RET" . vertico-directory-enter)
     ("DEL" . vertico-directory-delete-char)
     ("M-DEL" . vertico-directory-delete-word)
     )
    :hook
    (rfn-eshadow-update-overlay . vertico-directory-tidy)
    )

#+end_src

** [[https://github.com/minad/marginalia][Marginalia]]

#+begin_quote

Marginalia in the minibuffer.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (use-package marginalia
    :ensure t
    :init
    (marginalia-mode)
    )

#+end_src

** End

#+begin_src emacs-lisp :tangle ./modules/gs-completion.el :mkdirp yes

  (provide 'gs-completion)
#+end_src

* Utilities

Generally useful packages for productivity and other aspects.

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes
  ;;; -*- lexical-binding: t -*-
#+end_src

** [[https://github.com/mhayashi1120/Emacs-wgrep][wgrep]]

#+begin_quote

Writable grep buffer to apply changes to files.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package wgrep
    :ensure t
    :hook
    (grep-mode . wgrep-setup)
    )

#+end_src

** [[https://github.com/jwiegley/alert][Alert]]

#+begin_quote

A Growl-like alerts notifier for Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package alert
    :custom
    (alert-default-style 'libnotify)
    :ensure t
    )

#+end_src

** [[https://github.com/SqrtMinusOne/pomm.el][Pomm]]

#+begin_quote

Implementation of Pomodoro and Third Time techniques for Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package pomm
    :commands
    (
     pomm
     pomm-third-time
     )
    :config
    (pomm-mode-line-mode)
    (add-hook 'pomm-on-status-changed-hook #'pomm--sync-org-clock)
    (add-hook 'pomm-third-time-on-status-changed-hook #'pomm-third-time--sync-org-clock)
    :custom
    (pomm-audio-enabled t)
    :ensure t
    )

#+end_src

** [[https://github.com/minad/consult][Consult]]

#+begin_quote

Consulting completing-read.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package consult
    :bind
    (
     ([remap flymake-start] . consult-flymake)
     ([remap goto-line] . consult-goto-line)
     ([remap grep] . consult-grep)
     ([remap imenu] . consult-imenu-multi)
     ([remap info] . consult-info)
     ([remap info-search] . consult-info)
     ([remap isearch-forward-word] . consult-line)
     ([remap list-buffers] . consult-buffer)
     ([remap load-theme] . consult-theme)
     ([remap locate] . consult-locate)
     ([remap man] . consult-man)
     ([remap rgrep] . consult-ripgrep)
     ([remap switch-to-buffer] . consult-buffer)
     ([remap yank-from-kill-ring] . consult-yank-from-kill-ring)
     ([remap yank-pop] . consult-yank-pop)
     )
    :config
    (defun choose-completion-in-region ()
      "Use default `completion--in-region' unless we are not completing."
      (when minibuffer-completion-table
        (setq-local completion-in-region-function #'completion--in-region)))
    (advice-add #'register-preview :override #'consult-register-window)
    (setf (alist-get 'log-edit-mode consult-mode-histories)
          'log-edit-comment-ring)
    :custom
    (consult-narrow-key "<")
    (register-preview-function #'consult-register-format)
    (xref-show-xrefs-function #'consult-xref)
    (xref-show-definitions-function #'consult-xref)
    :ensure t
    :hook
    (minibuffer-setup . choose-completion-in-region)
    )

#+end_src

*** [[https://github.com/oantolin/emacs-config/blob/master/init.el][Credits]]

*** [[https://github.com/karthink/consult-dir][Dir]]

#+begin_quote

Insert paths into the minibuffer prompt in Emacs.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package consult-dir
    :bind
    ([remap list-directory] . consult-dir)
    ([remap dired-jump] . consult-dir-jump-file)
    :ensure t
    )

#+end_src

*** [[https://github.com/mclear-tools/consult-notes][Notes]]

#+begin_quote

Use consult to search notes.

#+end_quote

#+begin_src emacs-lisp :tangle ./modules/gs-utils.el :mkdirp yes

  (use-package consult-notes
    :config
    (when (locate-library "org-roam")
      (consult-notes-org-roam-mode))
    :ensure t
    )

#+end_src

